//--------------CLASS WORK-------------------

// task #1
/** Додати 2 скрипта на сторінку (напряму в тегу script та підключіть джс фаїл), у кожному з скриптів виведіть алерт з хеллов ворлд текстом. */
    function cTask_01(){
        alert('Hello world!');
    }
   
//task #2
/** Додати 2 повідомлення “Я люблю фронтенд” та “Я люблю JS”.  */
    function cTask_02(){
        alert('Я люблю фронтенд!');
        alert('Я люблю JS!');
    }

//task #3
/** Оголошуємо змінні: admin и name. Запишіть в name Ваше імя.В admin запишіть – undefined. Переприсвойте name в admin. Введіть admin. */
    function cTask_03(){
        let admin = undefined;
        let name = 'Svyatoslav';
        admin = name;
        alert(admin);
    }

//task #4
/** Запитати в юзера його імя, додати до імені – “Батькович” та вивести його на екран.  */
    function cTask_04(){
        let userName = prompt('Як Вас звати?');
        alert(`Вітаємо, ${userName} Батькович!`);
    }

//task #5
/** Undefined, e is not defined. Спробуємо вивести оголошену але не присвоєну змінну. */
    function cTask_05(){
        let testValue;
        alert(testValue);
    }

//-------------HOME WORK-------------

// task #1
/** Запитайте у юзера скільки йому років: «Привіт мені - “” років!». */
    function hTask_01(){
        let age = prompt('Скільки Вам років?');
        alert(`Привіт, мені ${age} років!`);
    }

//task #2
/** Запитайтесь якого року народження юзер, теперішній рік візьмемо за константу. Виведемо скільки йому років. */
    function hTask_02(){
        const currentYear = 2021;
        let born = prompt('У якому році Ви народилися?');
        alert(`Вам ${currentYear-born}!`);
    }

//task #3
/** Запитайтесь у юзера довжини сторін прямокутника та виведіть його периметр. */
    function hTask_03(){
        let side_1 = +prompt('Задайте довжину першої сторони прямокутника.');
        let side_2 = +prompt('Задайте довжину сусідньої сторони.');
        alert(`Отриманий периметр прямокутника: ${2*(side_1+side_2)}.`);
    }

//task #4
/** Запитайтесь в юзера радіус кола та виведіть його площу.(число пі) */
    function hTask_04(){
        let r = +prompt('Задайте радіус кола.');
        alert(`Отримана площа круга: ${Math.PI*r*r}, або ж ${Math.pow(r,2)}пі.`);
    }

//task #5
/** Водій їде з середньою швидкістю 50 км в годину. Запитайтесь у нього скільки ще йому необхідно часу їхати, та виведіть відстань. */
    function hTask_05(){
        const averageSpeed = 50;
        let time = +prompt('Скільки годин Вам ще потрібно їхати?');
        alert(`Вам залишилось проїхати ${averageSpeed*time} км !`);
    }

//task #6
/** Реалізуємо конвертер кілометрів в милі і навпаки =) */
    function hTask_06(){
        let km = +prompt('Задайте відстань (довжину) у кілометрах?');
        alert(`Отримане значення у милях: ${km*0.62137}.`);
        let mi = +prompt('Задайте відстань (довжину) у милях?');
        alert(`Отримане значення у кілометрах: ${mi*1.60934}.`);
    }

//task #7
/** Юзер вводить скільки коштів на його картці та ціну одного літра бензину. 
 * Виводимо скільки бензину він може купити та скільки грошей у нього залишиться. */
    function hTask_07(){
        let money = +prompt('Скільки грошей залишилось у Вас на картці?');
        let fuelPrice = +prompt('Ціна одного літра бензину станом на сьогодні?');
        let fuelToBuy = money/fuelPrice;
        let moneyLeft = money-(fuelPrice*Math.floor(fuelToBuy));
        alert(`Доступна кількість бензину: ${Math.floor(fuelToBuy)}л. Залишок коштів: ${moneyLeft} у.о.`);
    }